**1920번 풀이과정**

기존에 풀었던 기록이 있지만, C++로 풀었었고, 3년이 넘은 시간이 지나서 

다시 한번 풀어봤습니다.

먼저 변수 2개, 배열 2개를 선언하고,

스캐너를 사용해서 입력을 총 4줄 받는 것으로 구상했습니다.

2번의 반복문을 통해서 배열의 원소를 입력받는 것이 좋아보였습니다.

또한 2번째 배열의 원소들이 1번째 배열에 위치하는 지를 검사하기 위해서 

반복문을 통해서 검사하는 것으로 작성하였습니다.

또한 검사 결과를 저장할 변수를 선언한 후, 반복문 내에서 초기화를 통해서 

변수 1개 만으로 배열의 모든 원소의 결과값을 출력하였습니다.

1차 버전 제출 결과는 시간 초과였습니다.

<img width="1087" height="168" alt="Image" src="https://github.com/user-attachments/assets/bc612295-d47c-4e2c-9b0f-ce147ad04ea8" />

시간초과가 발생한 이유를 곰곰히 생각해보니, 

문제에서 입력받는 수의 최대 크기가 10만까지인데,

수의 검사과정을 반복문을 통해서 해결하려고 하니 문제가 발생하는 것 같아서 

HashMap을 사용해서 검사를 구현해보았습니다.

Key 값과 Value값을 모두 정수로 받도록 설정했고,

Value값을 사용하지 않아도 될 것 같아 0을 채워놓고 

Key값에 첫번째 비교당할 수를 저장하였습니다. 

또한 두번째 비교대상 수는 스캐너로 받아

containsKey를 사용하여 검사 후 If, Else 문을 통해서 검사 결과를 

출력하도록 작성하였습니다.

검사 과정이 간단하기 때문에 배열 대신 Map을 사용해서 빠르게 

Key값에 검사하는 수의 유무를 확인하여 결과를 출력하도록 진행하였고, 

그 결과 통과할 수 있었습니다.

<img width="1087" height="242" alt="Image" src="https://github.com/user-attachments/assets/ebf7e11a-0bd3-43e1-8399-e3f3ed968a17" />
